package SeaBattle;

public class Main {
    public static void main(String[] args) {

        Test.test();

        //TODO Создать класс Field который хранит в себе карту (двумерный массив) кораблей
        //TODO В классе field должен быть метод для получения урона по карте
        //TODO В классе field должна учитываться победа и поражение игроков (Если кораблей 0)
        //TODO В классе field должен быть метод для начала игры (бесконечный while, пока не произойдет победа или поражение)
        //TODO В классе Ship должен рассчитываться ореол корабля для использования этого метода в Field
        //TODO Создать класс Player в котором должен быть метод для начала игры между двумя игроками (передавая их Field) в качестве агрументов
    }
}
